cats = [('Мартин', 5, 'Алексей', 'Егоров'),
    	('Фродо', 3, 'Анна', 'Самохина'),
    	('Вася', 4, 'Андрей', 'Белов'),
    	('Муся', 7, 'Игорь', 'Бероев'),
    	('Изольда', 2, 'Игорь', 'Бероев'),
    	('Снейп', 1, 'Марина', 'Апраксина'),
    	('Лютик', 4, 'Виталий', 'Соломин'),
    	('Снежок', 3, 'Марина', 'Апраксина'),
    	('Марта', 5, 'Сергей', 'Колесников'),
    	('Буся', 12, 'Алена', 'Федорова'),
    	('Джонни', 10, 'Игорь', 'Андропов'),
    	('Мурзик', 1,'Даниил', 'Невзоров'),
    	('Барсик', 2, 'Виталий', 'Соломин'),
    	('Рыжик', 7, 'Владимир', 'Медведев'),
        ('Матильда', 8, 'Андрей', 'Белов'),
    	('Гарфилд', 3, 'Александр', 'Березуев')]

dict1 = {}
for cat, age, name, second_name in cats:
    full_name = f'{name} {second_name}'
    if full_name in dict1:
        dict1[full_name].extend([cat, age])
    else:
        dict1[full_name] = [cat, age]
print(dict1)
